# Ultralytics YOLO 🚀, AGPL-3.0 license
# MPA-YOLO for Steel Surface Defect Detection
# Based on [cite: 1, 6]

# Parameters
[cite_start]nc: 6  # NEU-DET has 6 classes [cite: 285] (Cr, In, Pa, Ps, Rs, Sc)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  
  # C2f-MPCA Replacement in Backbone (Layer 8) 
  - [-1, 3, C2f_MPCA, [1024, True]] # 8
  
  - [-1, 1, SPPF, [1024, 5]] # 9
  
  # PSA Added after SPPF 
  - [-1, 1, PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  
  # C2f-MPCA Replacement in Neck (Layer 13 equivalent) 
  - [-1, 3, C2f_MPCA, [512]] # 13
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  
  # C2f-MPCA Replacement in Neck (Layer 19 equivalent - wait, numbering shifts with extra PSA)
  # Standard v8 neck continues...
  - [cite_start][-1, 3, C2f, [256]] # 16 (P3/8-small) -> Note: Paper says Layer 16 is NOT replaced [cite: 502]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  
  # C2f-MPCA Replacement in Neck 
  - [-1, 3, C2f_MPCA, [512]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5 (PSA output)
  
  # C2f-MPCA Replacement in Neck 
  - [-1, 3, C2f_MPCA, [1024]] # 22 (P5/32-large)

  # Detect Head
  # Note: Aux heads are architectural branches, but require custom loss code.
  # For this implementation, we use the standard Detect head which connects to the 3 main outputs.
  - [[16, 19, 22], 1, Detect, [nc]]